RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_can.c
  CANx->CR |= CAN_CR_TEST;
  CANx->TR = u8TestMask;
}

/*********************************************************************************************************//**
 * @brief  Leave the test mode
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
  ***********************************************************************************************************/
void CAN_LeaveTestMode(HT_CAN_TypeDef *CANx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  CANx->CR |= CAN_CR_TEST;
  CANx->TR &= ~(CAN_MODE_LBACK | CAN_MODE_SILENT | CAN_MODE_BASIC | CAN_MODE_TX_RECESSIVE);
  CANx->CR &= (~CAN_CR_TEST);
}

/*********************************************************************************************************//**
 * @brief  The function is used to Send CAN message in BASIC mode of test mode. Before call the API,
 *         the user should be call CAN_EnterTestMode(CAN_TEST_BASIC) and let CAN controller enter
 *         basic mode of test mode. Please notice IF0 Registers used as Tx Buffer in basic mode.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the data buffer to be transmitted.
 * @param  len: Length of the data to be transmitted.
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus CAN_BasicSendMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  if (CANx->SR & CAN_FLAG_BOFF)
  {
    return ERROR;
  }
  while (CANx->IF0.CREQ & CAN_FLAG_IF_BUSY)
  {
  }

  CANx->SR &= (~CAN_FLAG_TXOK);

  if (pCanMsg->IdType == CAN_STD_ID)
  {
    /* standard ID                                                                                          */
    CANx->IF0.ARB0 = 0;
    CANx->IF0.ARB1 = (((pCanMsg->Id) & CAN_STD_FRAME_Msk) << 2);
  }
  else
  {
    /* extended ID                                                                                          */
    CANx->IF0.ARB0 = (pCanMsg->Id)          & CAN_EXT_FRAME_LSB_Msk;
    CANx->IF0.ARB1 = (((pCanMsg->Id) >> 16) & CAN_EXT_FRAME_MSB_Msk) | CAN_IF_ARB1_XTD;
  }

  if (pCanMsg->FrameType)
    CANx->IF0.ARB1 |= CAN_IF_ARB1_DIR;
  else
    CANx->IF0.ARB1 &= (~CAN_IF_ARB1_DIR);

  CANx->IF0.MCR  = (CANx->IF0.MCR & (~CAN_IF_MCR_DLC_Msk)) | len;
  CANx->IF0.DA0R = ((u16)data[1] << 8) | data[0];
  CANx->IF0.DA1R = ((u16)data[3] << 8) | data[2];
  CANx->IF0.DB0R = ((u16)data[5] << 8) | data[4];
  CANx->IF0.DB1R = ((u16)data[7] << 8) | data[6];

  /* request transmission                                                                                   */
  CANx->IF0.CREQ &= (~CAN_FLAG_IF_BUSY);
  if (CANx->IF0.CREQ & CAN_FLAG_IF_BUSY)
  {
    return ERROR;
  }

  CANx->IF0.CREQ |= CAN_FLAG_IF_BUSY; /* Sending                                                            */

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Get a message information in BASIC mode.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the buffer where received data will be stored.
 * @param  len: Pointer to a variable that will store the length of the received data.
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus CAN_BasicReceiveMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8* len)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  if ((CANx->IF1.MCR & CAN_IF_MCR_NEWDAT) == 0)   /* In basic mode, receive data always save in IF1         */
  {
      return ERROR;
  }

  CANx->SR &= (~CAN_FLAG_RXOK);

  CANx->IF1.CMASK = CAN_IF_CMASK_ARB
                  | CAN_IF_CMASK_CONTROL
                  | CAN_IF_CMASK_DATAA
                  | CAN_IF_CMASK_DATAB;

  if ((CANx->IF1.MASK1 & CAN_IF_ARB1_XTD) == 0)
  {
    /* standard ID                                                                                          */
    pCanMsg->IdType = CAN_STD_ID;
    pCanMsg->Id = (CANx->IF1.MASK1 >> 2) & CAN_STD_FRAME_Msk;
  }
  else
  {
    /* extended ID                                                                                          */
    pCanMsg->IdType = CAN_EXT_ID;
    pCanMsg->Id     = (CANx->IF1.ARB1 & CAN_EXT_FRAME_MSB_Msk) << 16;
    pCanMsg->Id     |= (u32)CANx->IF1.ARB0;
  }

  *len     = CANx->IF1.MCR & CAN_IF_MCR_DLC_Msk;
  data[0] = CANx->IF1.DA0R & CAN_IF_DAT_A0_DATA0_Msk;
  data[1] = (CANx->IF1.DA0R & CAN_IF_DAT_A0_DATA1_Msk) >> CAN_IF_DAT_A0_DATA1_Pos;
  data[2] = CANx->IF1.DA1R & CAN_IF_DAT_A1_DATA2_Msk;
  data[3] = (CANx->IF1.DA1R & CAN_IF_DAT_A1_DATA3_Msk) >> CAN_IF_DAT_A1_DATA3_Pos;
  data[4] = CANx->IF1.DB0R & CAN_IF_DAT_B0_DATA4_Msk;
  data[5] = (CANx->IF1.DB0R & CAN_IF_DAT_B0_DATA5_Msk) >> CAN_IF_DAT_B0_DATA5_Pos;
  data[6] = CANx->IF1.DB1R & CAN_IF_DAT_B1_DATA6_Msk;
  data[7] = (CANx->IF1.DB1R & CAN_IF_DAT_B1_DATA7_Msk) >> CAN_IF_DAT_B1_DATA7_Pos;

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Send CAN message.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the data buffer to be transmitted.
 * @param  len: Length of the data to be transmitted.
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus CAN_Transmit(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  if (_CAN_SetTxMsg(CANx, pCanMsg, data, len) == ERROR)
  {
    return ERROR;
  }
  return (CAN_TriggerTxMsg(CANx, pCanMsg));
}

