RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_can.c
/*********************************************************************************************************//**
 * @brief  Gets the message, if received.
 *         The Interface Registers avoid conflict between the CPU accesses to the Message RAM and CAN message
 *         reception and transmission by buffering the data to be transferred.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the buffer where received data will be stored.
 * @param  len: Pointer to a variable that will store the length of the received data.
 * @retval RxStatus_TypeDef: Returns the status of the message reception. Possible values are:
 *    - MSG_OBJ_NOT_SET
 *    - MSG_NOT_RECEIVED
 *    - MSG_OVER_RUN
  ***********************************************************************************************************/
CAN_RxStatus_TypeDef CAN_Receive(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u32* len)
{
  u32 _MsgNum = pCanMsg->MsgNum;
  CAN_RxStatus_TypeDef status = MSG_OBJ_NOT_SET;
  bool firstMsg = TRUE;
  *len = 0;
  if (_CAN_CheckMsgIsValid(CANx, pCanMsg->MsgNum) != FALSE)
  {
    while (1)
    {
      s32 ReadMsgStatus;
      if (_CAN_GetNewData(CANx, _MsgNum) == FALSE)
      {
        if (firstMsg == TRUE)
          status = MSG_NOT_RECEIVED;
        else
          status = MSG_RX_FINISH;
        break;
      }
      firstMsg = FALSE;
      ReadMsgStatus = _CAN_ReadMsgObj(CANx, _MsgNum, TRUE, pCanMsg, &data[*len], len);
      if (ReadMsgStatus != 0)
      {
        if (ReadMsgStatus == 2)
        {
          status = MSG_OVER_RUN;
          break;
        }
        status = MSG_RX_FINISH;
        break;
      }
      _MsgNum++;
    }
  }
  return status;
}

/*********************************************************************************************************//**
 * @brief  Cancels a transmit request.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus CAN_CancelTransmit(HT_CAN_TypeDef* CANx, CAN_MSG_TypeDef* pCanMsg)
{
  HT_CANIF_TypeDef *IFx = NULL;
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  if (_CAN_CheckMsgIsValid(CANx, pCanMsg->MsgNum) == FALSE)
  {
    return ERROR;
  }

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }
  if ((IFx->CREQ & CAN_FLAG_IF_BUSY) == 0)
  {
    IFx->CMASK = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_CLRINTPND;
    IFx->MCR   = 0;
    IFx->CREQ = pCanMsg->MsgNum;
  }

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Discard the specified FIFO.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus CAN_DiscardRxMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  if (_CAN_CheckMsgIsValid(CANx, pCanMsg->MsgNum) == FALSE)
  {
    return ERROR;
  }
  while (1)
  {
    HT_CANIF_TypeDef *IFx = NULL;
    while (IFx == NULL)
    {
      IFx = _GetFreeIF(CANx);
    }
    IFx->CMASK = CAN_IF_CMASK_TXRQSTNEWDAT | CAN_IF_CMASK_CONTROL;
    IFx->CREQ = pCanMsg->MsgNum;
    if (IFx->MCR & CAN_IF_MCR_EOB)
    {
      break;
    }
  }
  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  The function is used to configure several receive message objects.
 *         The Interface Registers avoid conflict between the CPU accesses to the Message RAM and CAN message
 *         reception and transmission by buffering the data to be transferred.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  FifoDepth: the number of MSG RAM of the FIFO.
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus CAN_SetRxMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u32 FifoDepth)
{
  s32 i = 0;
  u32 _MsgNum;

  u32 eob;
  if (pCanMsg->MsgNum == 0)
  {
    _MsgNum = _CAN_GetValidMsg(CANx);
  }
  else
  {
    _MsgNum = pCanMsg->MsgNum;
  }
  if ((_MsgNum + FifoDepth) > MSG_OBJ_TOTAL_NUM)
  {
    return ERROR;
  }
  pCanMsg->MsgNum = _MsgNum;
  eob = 0;
  for (i = _MsgNum; i < FifoDepth + _MsgNum + 1; i++)
  {
    if (i == FifoDepth + _MsgNum)
    {
      eob = 1;
    }
    _CAN_SetRxMsgObj(CANx, i, pCanMsg, eob);
  }
  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Get the waiting status of a received message.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval TRUE: The corresponding message object has a new data bit is set, FALSE otherwise.
  ***********************************************************************************************************/
bool CAN_NewDataReceived(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg)
{

  if (_CAN_CheckMsgIsValid(CANx, pCanMsg->MsgNum) == FALSE)
  {
    return FALSE;
  }
  return _CAN_GetNewData(CANx, pCanMsg->MsgNum);
}

/*********************************************************************************************************//**
 * @brief  Get the interrupt pending status of a message object.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval TRUE: The corresponding message object has a interrupt pending bit is set, FALSE otherwise.
  ***********************************************************************************************************/
bool CAN_GetMsgPending(HT_CAN_TypeDef* CANx, CAN_MSG_TypeDef* pCanMsg)
{
  u32 Pending =  CANx->IPR0;
  Pending    |=  CANx->IPR1 << 16;

  if (_CAN_CheckMsgIsValid(CANx, pCanMsg->MsgNum) == FALSE)
  {
    return FALSE;
  }

