RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_can.c
  if ((Pending & 1 << (pCanMsg->MsgNum - 1)) == 0)
  {
    return FALSE;
  }
  return TRUE;
}

/*********************************************************************************************************//**
 * @brief  Clear interrupt pending bit.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus CAN_ClearMsgPendingFlag(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg)
{
  if (_CAN_CheckMsgIsValid(CANx, pCanMsg->MsgNum) == FALSE)
  {
    return ERROR;
  }
  _CAN_ClearMsgPendingFlag(CANx, pCanMsg->MsgNum);

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Checks the transmission of a message object.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval 0: Transmitting, 1: Transmission successful, -1: Transmission failed.
  ***********************************************************************************************************/
s32 CAN_TransmitStatus(HT_CAN_TypeDef* CANx, CAN_MSG_TypeDef* pCanMsg)
{
  s32 TxStatus = 0;
  u32 u32Reg;
  s32 MsgNum = pCanMsg->MsgNum -1;

  if (_CAN_CheckMsgIsValid(CANx, pCanMsg->MsgNum) == FALSE)
  {
    return -1;
  }

  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  u32Reg = CANx->TRR0;
  u32Reg |= (CANx->TRR1 << 16);
  MsgNum = 1 << (MsgNum);
  if ((u32Reg & (MsgNum)) == 0)
  {
    TxStatus = 1;
  }

  u32Reg = CANx->NDR0;
  u32Reg |= (CANx->NDR1 << 16);
  if ((u32Reg & (MsgNum)) > 0)
  {
    TxStatus = -1;
  }
  return TxStatus;
}

/*********************************************************************************************************//**
 * @brief  Updates the data of a specified CAN message object.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the data array.
 * @param  len: Length of the data to be sent, in bytes (maximum 8 bytes).
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus CAN_UpdateTxMsgData(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len)
{
  HT_CANIF_TypeDef *IFx = NULL;

  len  &= CAN_IF_MCR_DLC_Msk;
  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }

  if (_CAN_CheckMsgIsValid(CANx, pCanMsg->MsgNum) == FALSE)
  {
    return ERROR;
  }

  IFx->CMASK = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_DATAA | CAN_IF_CMASK_DATAB | CAN_IF_CMASK_CONTROL;

  IFx->MCR   &=  (~CAN_IF_MCR_DLC_Msk);
  IFx->MCR   |=  (len & CAN_IF_MCR_DLC_Msk);
  IFx->DA0R  = ((u16)(data[1] << 8) | data[0]);
  IFx->DA1R  = ((u16)(data[3] << 8) | data[2]);
  IFx->DB0R  = ((u16)(data[5] << 8) | data[4]);
  IFx->DB1R  = ((u16)(data[7] << 8) | data[6]);

  IFx->CREQ = pCanMsg->MsgNum;

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Set transmit request bit.
 *         If a transmission is requested by programming bit TxRqst/NewDat, the TxRqst will be ignored.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus CAN_TriggerTxMsg(HT_CAN_TypeDef  *CANx, CAN_MSG_TypeDef* pCanMsg)
{
  HT_CANIF_TypeDef *IFx = NULL;
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  if (CANx->SR & CAN_FLAG_BOFF)
  {
    return ERROR;
  }

  if (_CAN_CheckMsgIsValid(CANx, pCanMsg->MsgNum) == FALSE)
  {
    return ERROR;
  }

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }

  IFx->CMASK  = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_CONTROL;
  IFx->MCR    |= CAN_IF_MCR_NEWDAT | CAN_IF_MCR_TXRQST;
  IFx->CREQ   = pCanMsg->MsgNum;

  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Clears all pending message flags.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
  ***********************************************************************************************************/
void CAN_ClearAllMsgPendingFlag(HT_CAN_TypeDef *CANx)
{
  int i;
  u32 Pending =  CANx->IPR0;
  Pending    |=  CANx->IPR1 << 16;
  for (i = 0 ; i < MSG_OBJ_TOTAL_NUM ; i++)
  {
    if ((Pending & 1) == 1)
    {
      _CAN_ClearMsgPendingFlag(CANx, i + 1);
    }

    Pending = Pending >> 1;
    if (Pending == 0)
    {
      break;
    }
  }
}
/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup CAN_Private_Functions CAN private functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief  The function is used to configure a transmit object.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the data buffer to be transmitted.
 * @param  len: Length of the data to be transmitted.
 * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus _CAN_SetTxMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len)
{
  HT_CANIF_TypeDef *IFx = NULL;
  if (pCanMsg->MsgNum == 0)
  {
    pCanMsg->MsgNum = _CAN_GetValidMsg(CANx);
  }
  if (pCanMsg->MsgNum > MSG_OBJ_TOTAL_NUM)
  {
    return ERROR;
  }

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }

