RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_can.c
  /* update the contents needed for transmission                                                            */
  IFx->CMASK = CAN_IF_CMASK_WRRD | CAN_IF_CMASK_MASK | CAN_IF_CMASK_ARB
             | CAN_IF_CMASK_CONTROL | CAN_IF_CMASK_DATAA  | CAN_IF_CMASK_DATAB;

  if (pCanMsg->IdType == CAN_STD_ID)
  {
    /* standard ID                                                                                          */
    IFx->ARB0 = 0;
    IFx->ARB1 = (((pCanMsg->Id) & CAN_STD_FRAME_Msk) << 2) | CAN_IF_ARB1_DIR | CAN_IF_ARB1_MSGVAL;
  }
  else
  {
    /* extended ID                                                                                          */
    IFx->ARB0 = (pCanMsg->Id) & CAN_EXT_FRAME_LSB_Msk;
    IFx->ARB1 = (((pCanMsg->Id)  >> 16) & CAN_EXT_FRAME_MSB_Msk)
              | CAN_IF_ARB1_DIR | CAN_IF_ARB1_XTD | CAN_IF_ARB1_MSGVAL;
  }

  if (pCanMsg->FrameType)
    IFx->ARB1 |=   CAN_IF_ARB1_DIR;
  else
    IFx->ARB1 &= (~CAN_IF_ARB1_DIR);

  IFx->DA0R = ((u16)data[1] << 8) | data[0];
  IFx->DA1R = ((u16)data[3] << 8) | data[2];
  IFx->DB0R = ((u16)data[5] << 8) | data[4];
  IFx->DB1R = ((u16)data[7] << 8) | data[6];

  IFx->MCR = 0;

  IFx->MCR &= (~CAN_IF_MCR_RMTEN);

  IFx->MCR   |=  CAN_IF_MCR_NEWDAT | len | CAN_IF_MCR_TXIE;
  IFx->CREQ  = pCanMsg->MsgNum;
  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief  Get the waiting status of a received message.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  MsgNum: Specifies the Message object number, from 1 to 32.
 * @retval TRUE: The corresponding message object has a new data bit is set, FALSE otherwise.
  ***********************************************************************************************************/
bool _CAN_GetNewData(HT_CAN_TypeDef *CANx, u32 MsgNum)
{
  u32 NewData =  CANx->NDR0;
  NewData    |=  CANx->NDR1 << 16;

  if ((NewData & 1 << (MsgNum - 1)) == 0)
  {
    return FALSE;
  }
  return TRUE;
}

/*********************************************************************************************************//**
 * @brief  Get free interface.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval Free IF pointer. NULL: No IF is free
  ***********************************************************************************************************/
static HT_CANIF_TypeDef *_GetFreeIF(HT_CAN_TypeDef  *CANx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  if ((CANx->IF0.CREQ & CAN_FLAG_IF_BUSY) == 0)
  {
    return &CANx->IF0;
  }
  else if ((CANx->IF1.CREQ  & CAN_FLAG_IF_BUSY) == 0)
  {
    return &CANx->IF1;
  }
  else
  {
    return NULL;
   }
}

/*********************************************************************************************************//**
 * @brief  This function is used to set CAN to enter initialization mode and enable access bit timing
 *         register.After bit timing configuration ready, user must call CAN_LeaveInitMode() to leave
 *         initialization mode and lock bit timing register to let new configuration take effect.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
  ***********************************************************************************************************/
static void _CAN_EnterInitMode(HT_CAN_TypeDef *CANx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  CANx->CR |= CAN_CR_INIT;
  CANx->CR |= CAN_CR_CCE;
}

/*********************************************************************************************************//**
 * @brief  Leave initialization mode
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval None
  ***********************************************************************************************************/
static void _CAN_LeaveInitMode(HT_CAN_TypeDef *CANx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  CANx->CR &= (~(CAN_CR_INIT | CAN_CR_CCE));

  while (CANx->CR & CAN_CR_INIT); /* Check INIT bit is released                                             */
}

/*********************************************************************************************************//**
 * @brief  Set Rx message object
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  MsgNum: Specifies the Message object number, from 1 to 32.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  uSingleOrFifoLast: Specifies the end-of-buffer indicator.
 * @retval None
  ***********************************************************************************************************/
static void _CAN_SetRxMsgObj(HT_CAN_TypeDef  *CANx, u32 MsgNum, CAN_MSG_TypeDef* pCanMsg, u32 uSingleOrFifoLast)
{
  HT_CANIF_TypeDef *IFx = NULL;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));
  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }
  /* Command Setting                                                                                        */
  IFx->CMASK = CAN_IF_CMASK_WRRD    | CAN_IF_CMASK_MASK  | CAN_IF_CMASK_ARB |
               CAN_IF_CMASK_CONTROL | CAN_IF_CMASK_DATAA | CAN_IF_CMASK_DATAB;

  if (pCanMsg->IdType == CAN_STD_ID)  /* According STD/EXT ID format, Configure Mask and Arbitration register */
  {
    /* Standard Mask.(bit28..bit18).                                                                        */
    IFx->ARB0   = 0;
    IFx->ARB1   = CAN_IF_ARB1_MSGVAL | (pCanMsg->Id     & CAN_STD_FRAME_Msk) << 2;
    IFx->MASK0  = 0;
    IFx->MASK1  = CAN_IF_MASK1_MDIR  | (pCanMsg->IdMask & CAN_STD_FRAME_Msk) << 2;
  }
  else
  {
    IFx->ARB0   = pCanMsg->Id & CAN_EXT_FRAME_LSB_Msk;
    IFx->ARB1   = CAN_IF_ARB1_MSGVAL | CAN_IF_ARB1_XTD   | ((pCanMsg->Id >> 16) & CAN_EXT_FRAME_MSB_Msk);
    IFx->MASK0  = pCanMsg->IdMask & CAN_EXT_FRAME_LSB_Msk;
    IFx->MASK1  = CAN_IF_MASK1_MXTD  | CAN_IF_MASK1_MDIR | ((pCanMsg->IdMask>> 16) & CAN_EXT_FRAME_MSB_Msk);
  }

  IFx->MCR = CAN_IF_MCR_RXIE | CAN_IF_MCR_UMASK;

  if (pCanMsg->FrameType == CAN_REMOTE_FRAME)
  {

    IFx->ARB1  |= CAN_IF_ARB1_DIR;
    IFx->MCR   |= CAN_IF_MCR_RMTEN;
  }

