RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_can.c
  if (uSingleOrFifoLast)
    IFx->MCR |= CAN_IF_MCR_EOB;

  IFx->MCR &= (~CAN_IF_MCR_INTPND);
  IFx->MCR &= (~CAN_IF_MCR_NEWDAT);
  IFx->CREQ = MsgNum;
}

/*********************************************************************************************************//**
 * @brief  Gets the message
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  MsgNum: Specifies the Message object number, from 1 to 32.
 * @param  Release: Specifies the message release indicator.
 *         @arg TRUE : the message object is released when getting the data.
 *         @arg FALSE: the message object is not released.
 * @param  pCanMsg: Pointer to the message structure for transmitting or receiving data.
 * @param  data: Pointer to the buffer where received data will be stored.
 * @param  len: Pointer to a variable that will store the length of the received data.
* @retval  0: Data not empty, 1: Finish, 2: data over run
  ***********************************************************************************************************/
static s32 _CAN_ReadMsgObj(HT_CAN_TypeDef *CANx, u32 MsgNum, u32 Release, CAN_MSG_TypeDef* pCanMsg, u8* data, u32* len)
{
  HT_CANIF_TypeDef *IFx = NULL;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_CAN(CANx));

  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }

  /* read the message contents                                                                              */
  IFx->CMASK = CAN_IF_CMASK_MASK
             | CAN_IF_CMASK_ARB
             | CAN_IF_CMASK_CONTROL
             | CAN_IF_CMASK_CLRINTPND
             | (Release ? CAN_IF_CMASK_TXRQSTNEWDAT : 0)
             | CAN_IF_CMASK_DATAA
             | CAN_IF_CMASK_DATAB;

  IFx->CREQ = MsgNum;

  while (IFx->CREQ & CAN_FLAG_IF_BUSY)
  {
    /*Wait                                                                                                  */
  }

  if ((IFx->ARB1 & CAN_IF_ARB1_XTD) == 0)
  {
    /* standard ID                                                                                          */
    pCanMsg->Id     = (IFx->ARB1 & CAN_IF_ARB1_ID_Msk) >> 2;
  }
  else
  {
    /* extended ID                                                                                          */
    pCanMsg->Id  = (IFx->ARB1 & CAN_EXT_FRAME_MSB_Msk) << 16;
    pCanMsg->Id |= IFx->ARB0;
  }
  if ((IFx->MCR & CAN_IF_MCR_RMTEN) == 0)
  {
    pCanMsg->FrameType     = CAN_DATA_FRAME;
  }
  else
  {
    pCanMsg->FrameType     = CAN_REMOTE_FRAME;
  }

  *len += IFx->MCR & CAN_IF_MCR_DLC_Msk;
  data[0] = IFx->DA0R & CAN_IF_DAT_A0_DATA0_Msk;
  data[1] = (IFx->DA0R & CAN_IF_DAT_A0_DATA1_Msk) >> CAN_IF_DAT_A0_DATA1_Pos;
  data[2] = IFx->DA1R & CAN_IF_DAT_A1_DATA2_Msk;
  data[3] = (IFx->DA1R & CAN_IF_DAT_A1_DATA3_Msk) >> CAN_IF_DAT_A1_DATA3_Pos;
  data[4] = IFx->DB0R & CAN_IF_DAT_B0_DATA4_Msk;
  data[5] = (IFx->DB0R & CAN_IF_DAT_B0_DATA5_Msk) >> CAN_IF_DAT_B0_DATA5_Pos;
  data[6] = IFx->DB1R & CAN_IF_DAT_B1_DATA6_Msk;
  data[7] = (IFx->DB1R & CAN_IF_DAT_B1_DATA7_Msk) >> CAN_IF_DAT_B1_DATA7_Pos;
  if ((IFx->MCR & CAN_IF_MCR_MSGLST) > 0)
  {
    IFx->CMASK =CAN_IF_CMASK_WRRD | CAN_IF_CMASK_CONTROL;
    IFx->MCR &= ~CAN_IF_MCR_MSGLST;
    IFx->CREQ = MsgNum;
    IFx->CMASK =  CAN_IF_CMASK_TXRQSTNEWDAT;
    IFx->CREQ = MsgNum;
    return 2;
  }
  if ((IFx->MCR & CAN_IF_MCR_EOB) > 0)
  {
    return 1;
  }
  else
  {
    return 0;
  }
}

/*********************************************************************************************************//**
 * @brief  Gets the first valid message object number from the CAN message valid registers (MVR0 and MVR1).
 *         This function scans through the message object table to find the first valid message object that is
 *         not set (i.e., where the corresponding bit in the message valid register is 0).
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @retval The index of the first valid message object that is not set.
 ***********************************************************************************************************/
static int _CAN_GetValidMsg(HT_CAN_TypeDef *CANx)
{
  s32 _MsgNum;
  u32 msgNumTable = CANx->MVR0;
  msgNumTable |=  CANx->MVR1 << 16;
  for (_MsgNum = 0 ; _MsgNum < MSG_OBJ_TOTAL_NUM ; _MsgNum++)
  {
    if ((msgNumTable & 1) == 0)
    {
      break;
    }
    msgNumTable = msgNumTable >> 1;
  }
  return _MsgNum + 1;
}

/*********************************************************************************************************//**
 * @brief  Checks if the specified message number is valid.
 * @param  CANx: Pointer to the CAN peripheral.
 * @param  MsgNum: The message number.
 * @retval TRUE if the message number is valid, FALSE otherwise.
 ***********************************************************************************************************/
static bool _CAN_CheckMsgIsValid(HT_CAN_TypeDef *CANx, u32 MsgNum)
{
  if ((MsgNum == 0) || (MsgNum > MSG_OBJ_TOTAL_NUM))
  {
    return FALSE;
  }
  return TRUE;
}

/*********************************************************************************************************//**
 * @brief  Clears the pending flag for a specific CAN message object.
 * @param  CANx: where the CANx is the selected CAN from the CAN peripherals.
 * @param  MsgNum: The message number.
 * @retval None.
 ***********************************************************************************************************/
static void _CAN_ClearMsgPendingFlag(HT_CAN_TypeDef *CANx, u32 MsgNum)
{
  HT_CANIF_TypeDef *IFx = NULL;
  while (IFx == NULL)
  {
    IFx = _GetFreeIF(CANx);
  }
  IFx->CMASK = CAN_IF_CMASK_CLRINTPND;
  IFx->CREQ = MsgNum;
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
